// برای اینکه فولدر ها مرتب باشه برای فایل ریدیوسر یه ایندکس میسازیم و همه فایل هاش رو تو این قسمت اکسپورت می کنیم
// برای تجمیع کردن همه ریدیوسر ها اینجا کُمباین میکنیم
import {combineReducers} from 'redux'
import productReducer from "./productReducer"


// در اینجا ریدیوسر ها رو اکسپورت می کنیم و میتونیم براشون یه اسم بذاریم که من اینجا پروداکت استیت گذاشتم اسمشو
export default combineReducers ({
  // پروداکت ریدیوسر قراره یه استیت بسازه به اسم پروداکت استیت
  // داخل استورها استیت های مختلفی هستن که ما اینجا این ریدیوسر رو میریزیم تو پروداکت اسیت
  productState : productReducer

})

